Repository: plughacker/malga-woocommerce
Catalog: src/plugins/woocommerce-malga-payments/languages/malga-payments-gateway-*.po
Languages: pt_br

source: Please, select a payment method.
pt_br: Por favor, selecione um método de pagamento.

source: Accept payments by credit card, bank debit or banking ticket using the Malga Payments.
pt_br: Aceite pagamentos por cartão de crédito, débito ou boleto bancário usando a Malga pagamentos.

source: Pay
pt_br: Pagar

source: Title
pt_br: Título

source: This controls the title which the user sees during checkout.
pt_br: Isso controla o título que o usuário vê durante o checkout.

source: MalgaPayments
pt_br: Malga Pagamentos

source: Description
pt_br: Descrição

source: This controls the description which the user sees during checkout.
pt_br: Isso controla a descrição que o usuário vê durante o checkout.

source: Pay via Malga
pt_br: Pagamento via Malga

source: Minimum value of the installment
pt_br: Valor mínimo da parcela

source: Please enter your minimum value of the installment
pt_br: Informe o valor mínimo da parcela

source: Maximum number of installments
pt_br: Quantidade máxima de parcelas

source: Enter the maximum number of installments
pt_br: Informe o número máximo de parcelas

source: Debuger can be used to test the payments.
pt_br: Debuger pode ser usado para testar os pagamentos.

source: Use Fraudanalysis
pt_br: Utilizar FraudAnalysis

source: fraudAnalysis can be used otimize payments.
pt_br: fraudAnalysis pode ser usado se estiver habilitado no gateway.

source: Integration
pt_br: Integração

source: Please enter your X-Client-Id. This is needed in order to take payment.
pt_br: Por favor, insira seu X-Client-Id. Isso é necessário para receber o pagamento.

source: Please enter your X-Api-Key. This is needed in order to take payment.
pt_br: Por favor, insira seu X-Api-Key. Isso é necessário para receber o pagamento.

source: Please enter your MerchantId. This is needed in order to take payment.
pt_br: Por favor, insira seu MerchantId. Isso é necessário para receber o pagamento.

source: Enable Malga Sandbox
pt_br: Habilitar Malga Sandbox

source: Malga Sandbox can be used to test the payments.
pt_br: Malga Sandbox pode ser usado para testar os pagamentos.

source: Please enter your Malga email address. This is needed in order to take payment.
pt_br: Por favor, insira seu endereço de e-mail do Malga. Isso é necessário para receber o pagamento.

source: Please enter your Malga sandbox merchantId
pt_br: Por favor, insira seu Malga sandbox merchantId

source: Integration Behavior
pt_br: Comportamento de Integração

source: Statement descriptor
pt_br: Identificação da loja

source: Please enter a statement descriptor.
pt_br: Essa identificação aparecerá na fatura do cartão do seu cliente (statement descriptor).

source: Webhook Secret
pt_br: Chave de acesso para validar o Webhook

source: Please enter a Webhook Secret, use: %s
pt_br: Insira uma chave de acesso para o Webhook, pode ser um valor aleatório que só você conhece, depois cadastre o webhook para a seguinte url: %s

source: Transparent Checkout Options
pt_br: Opções de check-out transparente

source: Please enter your title of payment type
pt_br: Informe o titulo do meio de pagamento

source: Percent of discount
pt_br: Percentual de desconto

source: Malga: Payment approved.
pt_br: Malga: Pagamento aprovado.

source: Malga: Payment is pre-authorized
pt_br: Malga: O pagamento é pré-autorizado

source: Malga: Payment is pending
pt_br: Malga: O pagamento está pendente

source: Malga: Payment is failed
pt_br: Malga: O pagamento falhou

source: Malga: Payment is canceled
pt_br: Malga: Pagamento cancelado

source: Malga: Payment refunded
pt_br: Malga: Pagamento reembolsado

source: Malga: Payment came into dispute.
pt_br: Malga: O pagamento entrou em disputa.

source: discount
pt_br: desconto

source: Internal error :(
pt_br: Erro interno :(

source: Expires days
pt_br: Dias para expiração

source: Enter the number of days for the boleto to expire
pt_br: Insira o número de dias para o boleto expirar

source: Instructions
pt_br: Instruções

source: Please enter your instructions for Boleto
pt_br: Por favor, insira suas instruções para o Boleto

source: Interest
pt_br: Juros

source: Enter the format to interest
pt_br: Insira o formato de juros

source: Amount
pt_br: Valor

source: Percentage
pt_br: Percentual

source: Enter value for interest
pt_br: Insira o valor de juros

source: Enter days for interest
pt_br: Insira os dias de juros

source: Fine
pt_br: Multa

source: Enter the format to fine
pt_br: Insira o formato da multa

source: Enter value for fine
pt_br: Insira o valor para multa

source: Enter days for fine
pt_br: Insira a quantidade de dias para multa

source: Credit
pt_br: Crédito

source: Invalid CVV
pt_br: O código de segurança não é válido

source: Enable Credit
pt_br: Habilitar Crédito

source: Enable Pix
pt_br: Habilitar Pix

source: Enable Boleto
pt_br: Habilitar Boleto

source: credit discount
pt_br: desconto Cartão de crédito

source: pix discount
pt_br: desconto Pix

source: boleto discount
pt_br: desconto Boleto

source: invalid_cvv
pt_br: o código de segurança não é válido

source: merchant_not_found
pt_br: comerciante não encontrado

source: payment_not_supported
pt_br: pagamento não suportado

source: provider_not_found
pt_br: provedor não encontrado

source: invalid_document
pt_br: documento inválido

source: unauthorized_adapter
pt_br: adaptador não autorizado

source: card_pending_validation
pt_br: o código de segurança é necessário para prosseguir

source: card_not_found
pt_br: cartão não encontrado

source: invalid_source_type
pt_br: a propriedade customer é obrigatória ser utilizada no 'source_type' para pix

source: invalid_card_number
pt_br: número do cartão não é válido

source: invalid_holder_name
pt_br: nome do portador do cartão não é válido

source: invalid_expiration_date
pt_br: data de expiração do cartão não é válida

source: invalid_card_cvv
pt_br: código de segurança não é válido

source: customer_not_found
pt_br: cliente não encontrado

source: customer_has_not_pre_authorized
pt_br: cobrança ainda não foi pré-autorizada ou já foi capturada

source: amount_cannot_be_greater_than_transaction
pt_br: valor não pode ser maior do que o valor da transação

source: refund_greater_than_transaction
pt_br: não é possível fazer um reembolso maior do que o valor do pagamento

source: charge_has_not_yet_canceled
pt_br: cobrança ainda não foi cancelada

source: charge_already_voided
pt_br: cobrança já anulada/cancelada

source: transaction_not_found
pt_br: transação não encontrada

source: transaction_has_not_pre_authorized
pt_br: transação não foi pré-autorizada

source: Malga Disabled
pt_br: Malga desativado

source: You should inform your clientId.
pt_br: Você deve informar seu clientId.

source: You should inform your merchantId.
pt_br: Você deve informar seu merchantId.

source: You should inform your tokenId.
pt_br: Você deve informar seu tokenId.

source: Card Holder Name
pt_br: Nome do portador

source: as recorded on the card
pt_br: como impresso no cartão

source: Card Number
pt_br: Número do cartão

source: Expiry (MM/YYYY)
pt_br: Validade

source: Security Code
pt_br: Código de segurança

source: Installments
pt_br: Parcelas

source: the minimum value of the installment is %s.
pt_br: o valor mínimo da parcela é R$ %s.
